{
  "backend/main.mo": "Empty Motoko actor with no functions or state.",
  "feature_evidence.json": "Feature report describing the addition of a retro pink initial-load spinner and listing related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files including App, styles, Tailwind config, media utilities, hooks, and components.",
  "frontend/index.css": "Tailwind base and utility setup defining OKLCH color tokens, light/dark theme variables, and global background/foreground styling.",
  "frontend/index.html": "HTML entry that loads fonts, sets the app title, and mounts the React root with main.tsx.",
  "frontend/src/App.tsx": "Main React SPA rendering jokes, randomized videos/articles, header notices, an 800ms initial spinner, and iOS-style scroll indicator.",
  "frontend/src/components/HeaderClickNotice.tsx": "Dismissible timed banner component that auto-hides after 3 seconds.",
  "frontend/src/components/InitialLoadSpinner.tsx": "Retro pink loading spinner with 8 animated dots shown when visible=true.",
  "frontend/src/components/IosScrollIndicator.tsx": "Thin overlay scroll indicator showing a movable thumb based on scroll position.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor, refreshing it when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useIosScrollIndicator.ts": "Hook computing visibility, size, and position for an auto-fading iOS 4‑style scroll indicator.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH theme variables for light/dark modes plus custom glassmorphism utilities.",
  "frontend/src/lib/momMedia.ts": "Provides curated cooking-related YouTube videos and mom-written articles with helpers to return random subsets.",
  "frontend/src/main.tsx": "Initializes React with React Query, Internet Identity provider, and global styles, then renders the App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors sourced from CSS variables, typography, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, features, constraints, and architectural notes for the “your_mom’s_website” build."
}