{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Early-2000s pink initial-load spinner inside portal frame",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Show a brief, subtle retro pink loading spinner on initial app load, contained within the 480p portal frame without layout shift or backend changes.",
      "acceptanceCriteria": [
        "On first page load, a small pink spinner is visible for a short, fixed duration (e.g., ~400–1200ms) and then disappears automatically.",
        "The spinner styling reads as early-2000s/retro (simple shape, slightly pixelated/low-res feel) and does not introduce a blue/purple color theme.",
        "The spinner is visually contained within the portal frame UI (not full-screen over the entire browser), and it does not shift layout when it appears/disappears.",
        "The spinner overlay does not block interaction longer than necessary; after it disappears, all existing UI elements behave as before.",
        "No backend changes are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InitialLoadSpinner.tsx",
          "operation": "create",
          "description": "Create a small, early-2000s-inspired retro spinner React component (chunky/pixelated look) that can be positioned as an overlay within the portal frame; keep it lightweight and theme-aligned (pink)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the initial-load spinner into the existing single-page UI: add a short fixed-duration initial loading state (e.g., 800ms) on first mount and render the overlay inside the portal-frame/scroll container area using absolute positioning so it remains contained within the 480p portal frame and does not cause layout shift; ensure the overlay uses minimal/no pointer-event blocking and fully unmounts after the timer."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add CSS for the retro pink spinner and its container overlay (e.g., pixel/stepped animation, chunky dots, subtle translucent backing) using existing theme variables so it stays vibrant-pink and low-res/retro; ensure styles are scoped via new class names and do not affect global layout."
        }
      ]
    }
  ]
}